2412/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOproudmanAcousticPower
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

proudmanAcousticPower1
{
    // Mandatory entries
    type            proudmanAcousticPower;
    libs            (fieldFunctionObjects);

    // Optional entries
    alphaEps        0.1;
    aRef            340;
    rhoInf          1.0;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         5000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
